import json

score = {
    "Πρωτάθλημα": [
        {
            "name": "Θεριστές-Ενωμένοι",
            "Θεριστές-Ενωμένοι": "same",
            "Χριστοφόροι-Πρόμαχοι": "1-0",
            "Στρατιώτες":"2-0",
            "Συναθλητές":"3-0",
            "ΕΣ":"4-0"
            },
        {
            "name": "Χριστοφόροι-Πρόμαχοι",
            "Θεριστές-Ενωμένοι": "2-0",
            "Χριστοφόροι-Πρόμαχοι": "same",
            "Στρατιώτες":"2-0",
            "Συναθλητές":"3-0",
            "ΕΣ":"4-0"
         },
        {
            "name": "Στρατιώτες",
            "Θεριστές-Ενωμένοι": "4-0",
            "Χριστοφόροι-Πρόμαχοι": "1-0",
            "Στρατιώτες":"same",
            "Συναθλητές":"3-0",
            "ΕΣ":"4-0"
        },
        {
             
            "name": "Συναθλητές",
            "Θεριστές-Ενωμένοι": "4-0",
            "Χριστοφόροι-Πρόμαχοι": "1-0",
            "Στρατιώτες":"2-0",
            "Συναθλητές":"same",
            "ΕΣ":"4-0"
            },
        { 
            "name": "ΕΣ",
            "Θεριστές-Ενωμένοι": "4-0",
            "Χριστοφόροι-Πρόμαχοι": "1-0",
            "Στρατιώτες":"2-0",
            "Συναθλητές":"3-0",
            "ΕΣ":"same"
            }
    ]
}

json_string = json.dumps(score, indent=2)
with open('mydata.json','w') as f:
    f.write(json_string)